# Nhi·ªám v·ª• 2: Kh√°m ph√° v√† x·ª≠ l√Ω d·ªØ li·ªáu Marketing Campaign
**Ngu·ªìn d·ªØ li·ªáu:** [Customer Personality Analysis - Kaggle](https://www.kaggle.com/datasets/imakash3011/customer-personality-analysis)

### 1.Import th∆∞ vi·ªán v√† n·∫°p d·ªØ li·ªáu

In [4]:
# üîπ Import th∆∞ vi·ªán
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# üîπ N·∫°p d·ªØ li·ªáu (CSV tab-delimited)
marketing_data = pd.read_csv("data/marketing_campaign.csv", sep="\t")

# üîπ Ch·ªçn c√°c c·ªôt c·∫ßn thi·∫øt
cols_needed = ['ID','Year_Birth', 'Education','Marital_Status','Income',
               'Kidhome','Teenhome','Dt_Customer','Recency','NumStorePurchases','NumWebVisitsMonth']

# üîπ L·ªçc c·ªôt t·ªìn t·∫°i trong CSV
marketing_data = marketing_data[[c for c in cols_needed if c in marketing_data.columns]]

# üîπ Xem 5 d√≤ng ƒë·∫ßu ti√™n
marketing_data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5

Nh·∫≠n x√©t:
- D·ªØ li·ªáu g·ªìm c√°c th√¥ng tin nh√¢n kh·∫©u h·ªçc, t√¨nh tr·∫°ng h√¥n nh√¢n, thu nh·∫≠p, s·ªë con v√† h√†nh vi mua h√†ng c·ªßa kh√°ch h√†ng.
C·ªôt Dt_Customer th·ªÉ hi·ªán ng√†y tr·ªü th√†nh kh√°ch h√†ng, Recency l√† s·ªë ng√†y k·ªÉ t·ª´ l·∫ßn mua g·∫ßn nh·∫•t.

### 2.Lo·∫°i b·ªè d·ªØ li·ªáu tr√πng l·∫∑p

In [5]:
# X√≥a c√°c d√≤ng tr√πng l·∫∑p
marketing_data_duplicate = marketing_data.drop_duplicates()

# X√≥a d√≤ng c√≥ index = 1 (n·∫øu c·∫ßn)
marketing_data = marketing_data.drop(labels=[1], axis=0)

# X√≥a c·ªôt Year_Birth (v√≠ d·ª• minh h·ªça)
marketing_data = marketing_data.drop(labels=['Year_Birth'], axis=1)

# Ki·ªÉm tra k√≠ch th∆∞·ªõc sau khi x√≥a
marketing_data.shape

(2239, 10)

Nh·∫≠n x√©t:
- Sau khi lo·∫°i b·ªè tr√πng l·∫∑p, d·ªØ li·ªáu tr·ªü n√™n s·∫°ch h∆°n, gi·∫£m kh·∫£ nƒÉng sai l·ªách khi ph√¢n t√≠ch th·ªëng k√™.

### 3.Thay th·∫ø v√† thay ƒë·ªïi ƒë·ªãnh d·∫°ng d·ªØ li·ªáu

In [6]:
# Thay gi√° tr·ªã trong c·ªôt Teenhome
marketing_data['Teenhome_replaced'] = marketing_data['Teenhome'].replace(
    [0,1,2],
    ['has no teen','has teen','has teen']
)

# ƒêi·ªÅn gi√° tr·ªã thi·∫øu trong c·ªôt Income b·∫±ng 0
marketing_data['Income'] = marketing_data['Income'].fillna(0)

# Chuy·ªÉn ki·ªÉu d·ªØ li·ªáu t·ª´ float sang int
marketing_data['Income_changed'] = marketing_data['Income'].astype(int)

# Hi·ªÉn th·ªã v√†i d√≤ng ƒë·ªÉ ki·ªÉm tra
marketing_data.head()

,ID,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth,Teenhome_replaced,Income_changed
0,5524,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7,has no teen,58138
2,4141,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4,has no teen,71613
3,6182,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6,has no teen,26646
4,5324,PhD,Married,58293.0,1,0,19-01-2014,94,6,5,has no teen,58293
5,7446,Master,Together,62513.0,0,1,09-09-2013,16,10,6,has teen,62513

Nh·∫≠n x√©t:
- Vi·ªác thay th·∫ø gi√∫p d·ªØ li·ªáu d·ªÖ hi·ªÉu h∆°n cho ng∆∞·ªùi ƒë·ªçc.
- C·ªôt Income ƒë√£ ƒë∆∞·ª£c x·ª≠ l√Ω gi√° tr·ªã thi·∫øu v√† ƒë·ªïi sang ki·ªÉu s·ªë nguy√™n ƒë·ªÉ th·ªëng nh·∫•t ƒë·ªãnh d·∫°ng.

### 4.X·ª≠ l√Ω d·ªØ li·ªáu thi·∫øu

In [7]:
# Ki·ªÉm tra s·ªë l∆∞·ª£ng gi√° tr·ªã thi·∫øu
marketing_data.isnull().sum()

# Lo·∫°i b·ªè c√°c d√≤ng c√≥ gi√° tr·ªã thi·∫øu
marketing_data_withoutna = marketing_data.dropna(how='any')

# Ki·ªÉm tra k√≠ch th∆∞·ªõc sau khi lo·∫°i b·ªè
marketing_data_withoutna.shape

(2239, 12)

Nh·∫≠n x√©t:
- M·ªôt s·ªë c·ªôt c√≥ gi√° tr·ªã b·ªã thi·∫øu, ch·ªß y·∫øu l√† ·ªü c·ªôt Income.
- Sau khi lo·∫°i b·ªè c√°c d√≤ng ch·ª©a gi√° tr·ªã thi·∫øu, d·ªØ li·ªáu c√≥ k√≠ch th∆∞·ªõc nh·ªè h∆°n nh∆∞ng ƒë·∫£m b·∫£o t√≠nh to√†n v·∫πn.

### 5.K·∫øt lu·∫≠n chung

D·ªØ li·ªáu sau khi x·ª≠ l√Ω ƒë√£:
- Lo·∫°i b·ªè tr√πng l·∫∑p v√† d·ªØ li·ªáu thi·∫øu.
- Thay th·∫ø v√† ƒë·ªïi ƒë·ªãnh d·∫°ng d·ªØ li·ªáu h·ª£p l√Ω.
- S·∫µn s√†ng cho c√°c b∆∞·ªõc ph√¢n t√≠ch, tr·ª±c quan v√† hu·∫•n luy·ªán m√¥ h√¨nh ti·∫øp theo.